/*============================================================================
                      Copyright ГосНИИАС
..............................................................................
ПРОЕКТ       : модель изд. 101КС-В
..............................................................................
ИМЯ МОДУЛЯ   : Вспомогательные функции для кодировки и декодировки данных,
               идущих по линии Fibre Channel из изд.101КС-В
ИМЯ ФАЙЛА    : FC_func.h
АББРЕВИАТУРА : fc
АВТОР        : Мазур Е.Ф.
..............................................................................
ОПИСАНИЕ МОДУЛЯ: Данный модуль содержит вспомогательные функции, используемые
                 при запаковке и распаковке данных, передаваемых
                 по Fibre Channel в БЦВМ из изд. 101КС-В
..............................................................................
ФУНКЦИИ:
      Список экспортируемых функций модуля
         fcCodInt
         fcCodBit
         fcCodReal
         fcDecodInt
         fcDecodUInt
         fcDecodBit
         fcDecodReal

==============================================================================
*/
#ifndef CodG
#define CodG extern
#endif
typedef unsigned int  Word32;
//#include "Common.h"

/*--------------------------------------------------------------------------*/
/*                Типы                                                      */
/*   нет                                                                    */

/*--------------------------------------------------------------------------*/
/*                Константы                                                 */
/*   нет                                                                    */

/*--------------------------------------------------------------------------*/
/*                Переменные                                                */
/*   нет                                                                    */


/*
==============================================================================
ИМЯ ФУНКЦИИ: fcCodInt
..............................................................................
ОПИСАНИЕ   : Функция кодирует целое число в указанный диапазон
             разрядов.32 разрядного слова в формат линии Fibre Channel
..............................................................................
*/
void fcCodInt
(
   // Входные данные
   int      Sign,
   int      bitLeft,
   int      bitRight,
   int      Value,
   // Входы-Выходы
   Word32*  W
);


/*
==============================================================================
ИМЯ ФУНКЦИИ: fcCodBit
..............................................................................
ОПИСАНИЕ   : Функция кодирует один бит (значения 0 или 1) в указанный разряд
             32 разрядного слова в формат линии Fibre Channel
..............................................................................
*/
void fcCodBit
(
   // Входные данные
   int          bitNum,
   unsigned int Discret,
   // Входы-Выходы
   Word32*      W
);


/*
==============================================================================
ИМЯ ФУНКЦИИ: fcCodReal
..............................................................................
ОПИСАНИЕ   : Функция кодирует вещественное число в указанный
             диапазон разрядов.32 разрядного слова с определенной ЦСР в формат
             линии Fibre Channel
..............................................................................
*/
void fcCodReal
(
   int      Sign,
   int      bitLeft,
   int      bitRight,
   double   Value,
   double   MSB,
   // Входы-Выходы
   Word32*  W
);


/*
==============================================================================
ИМЯ ФУНКЦИИ: fcDecodInt
..............................................................................
ОПИСАНИЕ   : Функция декодирует указанный диапазон разрядов.32-разрядного
             слова из формата линии Fibre Channel в целое число
..............................................................................
*/
void fcDecodInt
(
   // Входные данные
   int     Sign,
   int     bitLeft,
   int     bitRight,
   Word32  W,
   // Выходные данные
   int*    Value
);


/*
==============================================================================
ИМЯ ФУНКЦИИ: fcDecodUInt
..............................................................................
ОПИСАНИЕ   : Функция декодирует заданный диапазон разрядов.32-разрядного
             слова из формата линии Fibre Channel в беззнаковое целое число
..............................................................................
*/
void fcDecodUInt
(
   // Входные данные
   int           bitLeft,
   int           bitRight,
   Word32        W,
   // Выходные данные
   unsigned int* Value
);


/*
==============================================================================
ИМЯ ФУНКЦИИ: fcDecodBit
..............................................................................
ОПИСАНИЕ   : Функция декодирует один бит (значения 0 или 1) из указанного
             разряда.32-разрядного слова в формате линии Fibre Channel
..............................................................................
*/
void fcDecodBit
(
   // Входные данные
   int           bitNum,
   Word32        W,
   // Выходные данные
   unsigned int* Discret
);


/*
==============================================================================
ИМЯ ФУНКЦИИ: fcDecodReal
..............................................................................
ОПИСАНИЕ  : Функция декодирует указанный диапазон разрядов 32-разрядного
            слова из формата линии Fibre Channel в вещественное число с учетом
            заданной цены старшего разряда (ЦСР).
..............................................................................
*/
void fcDecodReal
(
   // Входные данные
   int      Sign,
   int      bitLeft,
   int      bitRight,
   double   MSB,
   Word32   W,
   // Выходные данные
   double*  Value
);

void fcDecodUInt
(
   // Входные данные
   int		     Sign,
   int           bitLeft,
   int           bitRight,
   Word32        W,
   // Выходные данные
   unsigned int* Value
);

void fcDecodUChar
(
   // Входные данные
   int     Sign,
   int     bitLeft,
   int     bitRight,
   Word32  W,
   // Выходные данные
   unsigned char*    Value
);

#undef CodG
/*==========================================================================*/
