/*============================================================================
                      Copyright ГосНИИАС
..............................................................................
ПРОЕКТ       : модель изд. 101КС-В
..............................................................................
ИМЯ МОДУЛЯ   : Вспомогательные функции для кодировки и декодировки данных,
               идущих по линии МКИО из изд.101КС-В
ИМЯ ФАЙЛА    : MKIO_func.h
АББРЕВИАТУРА : mkio
АВТОР        : Мазур Е.Ф.
ДАТА         : 22.04.2011
..............................................................................
ОПИСАНИЕ МОДУЛЯ: Данный модуль содержит вспомогательные функции, используемые
                 при запаковке и распаковке данных, передаваемых
                 по линии МКИО в БЦВМ из изд. 101КС-В
..............................................................................
ФУНКЦИИ:
      Список экспортируемых функций модуля
         mkioCodInt
         mkioCodBit
         mkioCodReal
         mkioDecodInt
         mkioDecodUInt
         mkioDecodBit
         mkioDecodReal
      Список внутренних функций модуля
         mkioCreateMask

==============================================================================
*/
#ifndef CodG
#define CodG extern
#endif
typedef unsigned short  word16;
typedef unsigned int  Word32;
//#include "Common.h"

/* Нумерация разрядов, соответствует нумерации, принятой в линии МКИО 1553  */
/* (кодировка по ГОСТ: крайний левый бит - 04-й, крайний правый - 19-й).    */
/*                     старший 04 бит = pow(2,15), младший 19 бит = pow(2,0)*/
/*--------------------------------------------------------------------------*/
/*                Константы и макросы                                       */
/*   нет                                                                    */

/*--------------------------------------------------------------------------*/
/*                Типы                                                      */
/*   нет                                                                    */

/*--------------------------------------------------------------------------*/
/*                Переменные                                                */
/*   нет                                                                    */

/*
==============================================================================
ИМЯ ФУНКЦИИ: mkioCodInt
..............................................................................
ОПИСАНИЕ   : Функция кодирует целое число в указанный диапазон
             разрядов.16-разрядного слова в формат линии МКИО
..............................................................................
*/
void mkioCodInt
(
   // Входные данные
   int      Sign,
   int      bitLeft,
   int      bitRight,
   int      Value,
   // Входы-Выходы
   word16*  W
);


/*
==============================================================================
ИМЯ ФУНКЦИИ: mkioCodBit
..............................................................................
ОПИСАНИЕ   : Функция кодирует один бит (значения 0 или 1) в указанный разряд
             16-разрядного слова в формат линии МКИО
..............................................................................
*/
void mkioCodBit
(
   // Входные данные
   int          bitNum,
   unsigned int Discret,
   // Входы-Выходы
   word16*      W
);


/*
==============================================================================
ИМЯ ФУНКЦИИ: mkioCodReal
..............................................................................
ОПИСАНИЕ   : Функция кодирует вещественное число в указанный
             диапазон разрядов.16-разрядного слова с определенной ЦСР в формат
             линии МКИО
..............................................................................
*/
void mkioCodReal
(
   int      Sign,
   int      bitLeft,
   int      bitRight,
   double   Value,
   double   MSB,
   // Входы-Выходы
   word16*  W
);


/*
==============================================================================
ИМЯ ФУНКЦИИ: mkioDecodInt
..............................................................................
ОПИСАНИЕ   : Функция декодирует указанный диапазон разрядов.16-разрядного
             слова из формата линии МКИО в целое число
..............................................................................
*/
void mkioDecodInt
(
   // Входные данные
   int     Sign,
   int     bitLeft,
   int     bitRight,
   word16  W,
   // Выходные данные
   int*    Value
);


/*
==============================================================================
ИМЯ ФУНКЦИИ: mkioDecodUInt
..............................................................................
ОПИСАНИЕ   : Функция декодирует заданный диапазон разрядов.16-разрядного
             слова из формата линии МКИО в беззнаковое целое число
..............................................................................
*/
void mkioDecodUInt
(
   // Входные данные
   int           bitLeft,
   int           bitRight,
   word16        W,
   // Выходные данные
   unsigned int* Value
);


/*
==============================================================================
ИМЯ ФУНКЦИИ: mkioDecodBit
..............................................................................
ОПИСАНИЕ   : Функция декодирует один бит (значения 0 или 1) из указанного
             разряда.16-разрядного слова в формате линии МКИО
..............................................................................
*/
void mkioDecodBit
(
   // Входные данные
   int           bitNum,
   word16        W,
   // Выходные данные
   unsigned int* Discret
);


/*
==============================================================================
ИМЯ ФУНКЦИИ: mkioDecodReal
..............................................................................
ОПИСАНИЕ  : Функция декодирует указанный диапазон разрядов 16-разрядного
            слова из формата линии МКИО в вещественное число с учетом
            заданной цены старшего разряда (ЦСР).
..............................................................................
*/
void mkioDecodReal
(
   // Входные данные
   int      Sign,
   int      bitLeft,
   int      bitRight,
   double   MSB,
   word16   W,
   // Выходные данные
   double*  Value
);

#undef CodG
/*==========================================================================*/

/*
==============================================================================
ИМЯ ФУНКЦИИ: mkioDecodUInt
..............................................................................
ОПИСАНИЕ   : Функция декодирует заданный диапазон разрядов.16-разрядного
             слова из формата линии МКИО в беззнаковое целое число
..............................................................................
*/
void mkioDecodUChar
(
   // Входные данные
   int           bitLeft,
   int           bitRight,
   word16        W,
   // Выходные данные
   unsigned char* Value
);
